MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_cmp.c
/*******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_cmp.c
 **
 ** A detailed description is available at
 ** @link CmpGroup CMP @endlink
 **
 **   - 2018-10-22  1.0  Pangw First version for Device Driver Library of CMP.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_cmp.h"
#include "hc32f46x_utility.h"

#if (DDL_CMP_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup CmpGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter valid check for CMP Instances. */
#define IS_VALID_CMP(__CMPx__)  \
    ((M4_CMP1 == (__CMPx__)) || \
     (M4_CMP2 == (__CMPx__)) || \
     (M4_CMP3 == (__CMPx__)))

/*!< Parameter valid check for CMP function */
#define IS_VALID_CMP_FUNCTION(x) \
    ((CmpOutput == (x)) ||       \
     (CmpOutpuInv == (x)) ||     \
     (CmpVcoutOutput == (x)))

/*! Parameter validity check for edge sel. */
#define IS_VALID_EDGESEL(x)    \
    ((CmpNoneEdge == (x)) ||   \
     (CmpBothEdge == (x)) ||   \
     (CmpRisingEdge == (x)) || \
     (CmpFaillingEdge == (x)))

/*!< Parameter CMP FLT validity check for clock division. */
#define IS_VALID_FLTCLK_DIVISION(x) \
    ((CmpFltPclk3Div1 == (x)) ||    \
     (CmpFltPclk3Div2 == (x)) ||    \
     (CmpFltPclk3Div4 == (x)) ||    \
     (CmpFltPclk3Div8 == (x)) ||    \
     (CmpFltPclk3Div16 == (x)) ||   \
     (CmpFltPclk3Div32 == (x)) ||   \
     (CmpFltPclk3Div64 == (x)))

/*!< Parameter validity check for INP4 SEL. */
#define IS_VALID_INP4SEL(x)     \
    ((CmpInp4None == (x)) ||    \
     (CmpInp4PGAO == (x)) ||    \
     (CmpInp4PGAO_BP == (x)) || \
     (CmpInp4CMP1_INP4 == (x)))

/*!< Parameter validity check for INP INPUT SEL. */
#define IS_VALID_INPSEL(x)         \
    ((CmpInpNone == (x)) ||        \
     (CmpInp1 == (x)) ||           \
     (CmpInp2 == (x)) ||           \
     (CmpInp3 == (x)) ||           \
     (CmpInp4 == (x)) ||           \
     (CmpInp1_Inp2 == (x)) ||      \
     (CmpInp1_Inp3 == (x)) ||      \
     (CmpInp2_Inp3 == (x)) ||      \
     (CmpInp1_Inp4 == (x)) ||      \
     (CmpInp2_Inp4 == (x)) ||      \
     (CmpInp3_Inp4 == (x)) ||      \
     (CmpInp1_Inp2_Inp3 == (x)) || \
     (CmpInp1_Inp2_Inp4 == (x)) || \
     (CmpInp1_Inp3_Inp4 == (x)) || \
     (CmpInp2_Inp3_Inp4 == (x)) || \
     (CmpInp1_Inp2_Inp3_Inp4 == (x)))

/*!< Parameter validity check for INM INPUT SEL. */
#define IS_VALID_INMSEL(x) \
    ((CmpInm1 == (x)) ||   \
     (CmpInm2 == (x)) ||   \
     (CmpInm3 == (x)) ||   \
     (CmpInm4 == (x)) ||   \
     (CmpInmNone == (x)))

/*!< Parameter validity check for CMP_CR channel. */
#define IS_VALID_CMP_CR_CH(x) \
    ((CmpDac1 == (x)) ||      \
     (CmpDac2 == (x)))

/*!< Parameter validity check for ADC internal reference voltage path. */
#define IS_VALID_ADC_REF_VOLT_PATH(x)  \
    ((CmpAdcRefVoltPathDac1 == (x)) || \
     (CmpAdcRefVoltPathDac2 == (x)) || \
     (CmpAdcRefVoltPathVref == (x)))

/*!< RVADC Write Protection Key. */
#define RVADC_WRITE_PROT_KEY (0x5500u)

/*!< Timer4x ECER register address. */
#define CMP_CR_DADRx(__DACx__) \
    ((CmpDac1 == (__DACx__)) ? &M4_CMP_CR->DADR1 : &M4_CMP_CR->DADR2)

