MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_cmp.c
    /* Check CMPx pointer */
    if (IS_VALID_CMP(CMPx))
    {
        CMPx->CTRL_f.IEN = (uint16_t)(enCmd);
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set scan time(scan stable&&period)
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 ** \param [in] u8ScanStable            CMP scan stable value
 ** \arg u8ScanStable < 16
 ** \param [in] u8ScanPeriod            CMP scan period value
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       CMPx is invalid
 **
 ** \note   u8ScanStable && u8ScanPeriod value must meet following condition:
 **             u8ScanPeriod > u8ScanStable + FLTSL_DIV*4 + 5
 **             FLTSL_DIV is filter sample period division(refer CMPx->CTRL_f.FLTSL)
 **
 ******************************************************************************/
en_result_t CMP_SetScanTime(M4_CMP_TypeDef *CMPx,
                            uint8_t u8ScanStable,
                            uint8_t u8ScanPeriod)
{
    uint16_t u16Flts;
    uint16_t u16FltslDiv;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check CMPx pointer */
    if ((!IS_VALID_CMP(CMPx)) || (u8ScanStable & 0xF0u))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        u16Flts = CMPx->CTRL_f.FLTSL;
        u16FltslDiv = ((uint16_t)1u << (u16Flts - 1u));

        if ((0u != u16Flts) &&
            (u8ScanPeriod <= (u8ScanStable + u16FltslDiv * 4u + 5u)))
        {
            enRet = ErrorInvalidParameter;
        }
        else
        {
            CMPx->CVSSTB_f.STB = u8ScanStable;
            CMPx->CVSPRD_f.PRD = u8ScanPeriod;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable the specified CMP function.
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 ** \param [in] enFunc                  CMP function selection
 ** \arg CmpVcoutOutput                 CMP Vcout output enable function
 ** \arg CmpOutpuInv                    CMP output invert enable function
 ** \arg CmpOutput                      CMP output enable function
 ** \param [in] enCmd                   CMP functional state
 ** \arg Enable                         Enable the specified CMP function
 ** \arg Disable                        Disable the specified CMP function
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       CMPx is invalid
 **
 ******************************************************************************/
en_result_t CMP_FuncCmd(M4_CMP_TypeDef *CMPx,
                        en_cmp_func_t enFunc,
                        en_functional_state_t enCmd)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check CMPx pointer */
    if (IS_VALID_CMP(CMPx))
    {
        /* Check parameter */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enCmd));
        DDL_ASSERT(IS_VALID_CMP_FUNCTION(enFunc));

        if (Enable == enCmd)
        {
            CMPx->CTRL |= (uint16_t)enFunc;
        }
        else
        {
            CMPx->CTRL &= (uint16_t)(~((uint16_t)enFunc));
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Start CMP scan
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 **
 ** \retval Ok                          Start successfully
 ** \retval ErrorInvalidParameter       CMPx is invalid
 **
 ******************************************************************************/
en_result_t CMP_StartScan(M4_CMP_TypeDef *CMPx)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check CMPx pointer */
    if (IS_VALID_CMP(CMPx))
    {
        CMPx->CTRL_f.CVSEN = (uint16_t)1u;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Stop CMP scan
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 **
 ** \retval Ok                          Stop successfully
 ** \retval ErrorInvalidParameter       CMPx is invalid
 **
 ******************************************************************************/
en_result_t CMP_StopScan(M4_CMP_TypeDef *CMPx)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check CMPx pointer */
    if (IS_VALID_CMP(CMPx))
    {
        CMPx->CTRL_f.CVSEN = (uint16_t)0u;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set CMP filter sample clock division.
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 ** \param [in] enFltClkDiv             The CMP filter sample clock division selection
 ** \arg CmpNoneFlt                     Unuse filter
 ** \arg CmpFltPclk3Div1                PCLK3/1
 ** \arg CmpFltPclk3Div2                PCLK3/2
 ** \arg CmpFltPclk3Div4                PCLK3/4
 ** \arg CmpFltPclk3Div8                PCLK3/8
 ** \arg CmpFltPclk3Div16               PCLK3/16
 ** \arg CmpFltPclk3Div32               PCLK3/32
 ** \arg CmpFltPclk3Div64               PCLK3/64
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       CMPx is invalid
 **
 ******************************************************************************/
en_result_t CMP_SetFilterClkDiv(M4_CMP_TypeDef *CMPx,
                                en_cmp_fltclk_div_t enFltClkDiv)
{
    en_result_t enRet = ErrorInvalidParameter;

